/* date = August 17th 2022 6:37 pm */

/*

- No includes in this file, but write out errors if things
  aren't present that should be

- Intrinsics - cmp and swap, incrememnt, decrement

- Memory
  x Allocators
    - Allocation Tracking

 x Time
- Thread

- Data Structures
  x Stretchy Buffers
  x Hash Table

 x Basic String Manipulation
   x Ascii, Utf8 & Utf32
  - snprintf, with ability to replace with stb_snprintf

 x File I/O
  - 

  - Sorting
- 

Multiple OSes represented in one file
**NO GRAPHICS, all the other stuff though**

*/

// TODO(PS): 
// - is there a way to determine if compiling to WASM without Emscripten?

////////////////////////////////////////////////////////
// CONTEXT 
// NOTE: credit here goes to the dion team. A lot of this was
// inspired/pulled from metadesk.h

#define ENV_COMPILER_CLANG 1

#define ENV_OS_MAC 0
#define ENV_OS_LINUX 0
#define ENV_OS_WINDOWS 0
#define ENV_OS_WASM 0
#define ENV_OS_EMSCRIPTEN 0
#define ENV_OS_ANDROID 0

#define ENV_ARCH_X64 0
#define ENV_ARCH_X86 0
#define ENV_ARCH_ARM64 0
#define ENV_ARCH_ARM32 0

#define ENV_LANG_CPP 0
#define ENV_LANG_C 0

// Compiler ID
#if defined(__clang__)
#  define ENV_COMPILER_CLANG 1

// Clang Platform ID
#  if defined(__APPLE__) && defined(__MACH__)
#    undef  ENV_OS_MAC
#    define ENV_OS_MAC 1
#  elif defined(__gnu_linux__) || defined(__linux__)
#    undef  ENV_OS_LINUX
#    define ENV_OS_LINUX 1
#  elif defined(_WIN32) || defined(_WIN64)
#    undef  ENV_OS_WINDOWS

////////////////////////////////////////////////////////
// MACRO UTILITIES

// This can be overriden to make all the functions in this
// file be static or to add boilerplate to each function
#if !defined(ENV_FUNCTION)
#  define ENV_FUNCTION
#endif

// Static has many meanings. These macros provide semantically
// relevant keywords for each use
#define internal      static
#define local_persist static
#define global        static
#define local_const   static const
#define global_const  static const

#define external      extern "C"

// Glue two strings together within a macro
// ie. macro_glue(foo, _bar) would produce foo_bar
#define macro_glue_(a,b) a##b
#define macro_glue(a,b) macro_glue_(a,b)

// Turns an identifier into a CString
// ie. macro_stringify(foobar) -> "foobar"
#define macro_stringify_(a) #a
#define macro_stringify(a) macro_stringify_(a)

#define macro_statement(s) do { s } while(0)

// A macro utility that just expands to invalid code
// that will crash the compiler. Good for picking up 
// where you left off
#define dont_compile ImAfraidICantDoThat

// good for tagging #if blocks that you create during
// development, but might need to remember to reenable
// later
#define temp_omit false

#if ENV_LANG_CPP

#  define ZEROED_STRUCT {}
#  define ZERO_STRUCT(type) type{}

#  define LINK_BEGIN extern "C" {
#  define LINK_END   }

#else

#  define ZEROED_STRUCT {0}
#  define ZERO_STRUCT(type) (type){0}

#  define LINK_BEGIN
#  define LINK_END

#endif

// Overridable error printing behavior
#if !defined(error_printf)
#  define error_printf(...) macro_statement(printf("Error: "); printf(__VA_ARGS__); )
#endif

////////////////////////////////////////////////////////
// ASSERT
//
#if !defined(ENV_NO_ASSERTS)

// Run Time Assert

#if !ENV_OS_WASM
#  define assert_always (*((volatile int*)0) = 0xFFFFFFFF)
#else
#  define macro_statement(printf("Assert Failed: %s:%d - %s\n", __FILE__, __LINE__, __FUNCTION__); abort();) 
#endif // !ENV_OS_EMSCRIPTEN

#  if !defined(assert)
#    if defined(ENV_DEBUG)

// Stops execution of the program if the expr evaluates to false
#      define assert(expr) if(!(expr)) { assert_always; }

// asserts always, but semantically indicates that a codepath
// should never be reached
#      define invalid_code_path assert_always

// asserts any time the default case of a switch statement
// is evaluated. 
#      define invalid_default_case default: { assert_always; } break;
#    else
#      define assert(expr)
#      define invalid_code_path
#      define invalid_default_case
#    endif
#  endif // !defined(assert)

// Static Assert
// Asserts at compile time
#  if !defined(static_assert)
#    if ENV_COMPILER_CLANG
#      define static_assert(value, error) _Static_assert((value), error)
#    endif
#  endif // !defined(assert)

#endif // !defined(ENV_NO_ASSERTS)

////////////////////////////////////////////////////////
// TYPES

// Signed Integers
typedef int8_t   s8;
typedef int16_t  s16;
typedef int32_t  s32;
typedef int64_t  s64;
static_assert(sizeof(s8)  == 1, "Incorrect size for s8");
static_assert(sizeof(s16) == 2, "Incorrect size for s16");
static_assert(sizeof(s32) == 4, "Incorrect size for s32");
static_assert(sizeof(s64) == 8, "Incorrect size for s64");

// Unsigned Integers
typedef uint8_t  u8;
typedef uint16_t u16;
typedef uint32_t u32;
typedef uint64_t u64;

static_assert(sizeof(u8)  == 1, "Incorrect size for u8");
static_assert(sizeof(u16) == 2, "Incorrect size for u16");
static_assert(sizeof(u32) == 4, "Incorrect size for u32");
static_assert(sizeof(u64) == 8, "Incorrect size for u64");

// Boolean & Flag Types
typedef s8  b8;
typedef s32 b32;
typedef s64 b64;

// True & False
#if !ENV_LANG_CPP
#  if !defined(true)
#    define true 1
#  endif
#  if  !defined(false)
#    define false 0
#  endif
#endif // !ENV_LANG_CPP

// Floats
typedef float  r32;
typedef double r64;

static_assert(sizeof(r32) == 4, "Incorrect size for r32");
static_assert(sizeof(r64) == 8, "Incorrect size for r64");

// Boundary values of basic types
global_const u8  max_u8  = 0xFF;
global_const u16 max_u16 = 0xFFFF;
global_const u32 max_u32 = 0xFFFFFFFF;
global_const u64 max_u64 = 0xFFFFFFFFFFFFFFFF;

global_const s8  max_s8  = 127;
global_const s16 max_s16 = 32767;
global_const s32 max_s32 = 2147483647;
global_const s64 max_s64 = 9223372036854775807;

global_const s8  min_s8  = -127 - 1;
global_const s16 min_s16 = -32767 - 1;
global_const s32 min_s32 = -2147483647 - 1;
global_const s64 min_s64 = -9223372036854775807 - 1;

global_const r32 max_r32  = 3.402823466e+38f;
global_const r32 min_r32  = -max_r32;
global_const r32 smallest_positive_r32 = 1.1754943508e-38f;
global_const r32 epsilon_r32 = 5.96046448e-8f;

global_const r32 pi_r32 = 3.14159265359f;
global_const r32 half_pi_r32 = 1.5707963267f;
global_const r32 tau_r32 = 6.28318530717f;

global_const r64 max_r64 = 1.79769313486231e+308;
global_const r64 min_r64 = -max_r64;
